<details><summary>Click to expand</summary>



**Plan for live/dev/demo-app**
```

time=2025-11-08T04:49:22Z level=info msg=Downloading Terraform configurations from file:///workspace into /workspace/live/dev/demo-app/.terragrunt-cache/v2SjVclYzyPAEkc2-ub6JEhA64g/iR00K09ud9CpNN9X6qOBki7MM4Y

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/google-beta from the dependency lock file
- Reusing previous version of hashicorp/google from the dependency lock file
- Installing hashicorp/google-beta v7.10.0...
- Installed hashicorp/google-beta v7.10.0 (signed by HashiCorp)
- Installing hashicorp/google v7.9.0...
- Installed hashicorp/google v7.9.0 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
google_project_service_identity.iap_sa: Refreshing state... [id=projects/dev-iac-demo/services/iap.googleapis.com]
data.google_client_config.default: Reading...
data.google_service_account_access_token.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/dev-iac-demo/regions/us-central1/zones/us-central1-a]
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/dev-iac-deployer@dev-iac-demo.iam.gserviceaccount.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=dev-iac-demo/run.googleapis.com]
google_firestore_database.database[0]: Refreshing state... [id=projects/dev-iac-demo/databases/demo-app-firestore]
data.google_compute_network.main: Reading...
google_project_service.apis["redis.googleapis.com"]: Refreshing state... [id=dev-iac-demo/redis.googleapis.com]
google_pubsub_topic.main_topic[0]: Refreshing state... [id=projects/dev-iac-demo/topics/demo-app-topic]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=dev-iac-demo/compute.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=dev-iac-demo/pubsub.googleapis.com]
google_project_service.apis["servicenetworking.googleapis.com"]: Refreshing state... [id=dev-iac-demo/servicenetworking.googleapis.com]
google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=dev-iac-demo/vpcaccess.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=dev-iac-demo/iam.googleapis.com]
google_project_service.apis["firestore.googleapis.com"]: Refreshing state... [id=dev-iac-demo/firestore.googleapis.com]
google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=dev-iac-demo/sqladmin.googleapis.com]
data.google_compute_network.main: Read complete after 1s [id=projects/sha-dmartinez-network/global/networks/my-dev-vpc]
google_compute_global_address.external_ip[0]: Refreshing state... [id=projects/dev-iac-demo/global/addresses/demo-app-external-lb-ip]
google_compute_managed_ssl_certificate.default[0]: Refreshing state... [id=projects/dev-iac-demo/global/sslCertificates/demo-app-ssl-cert]
data.google_compute_subnetwork.main: Reading...
data.google_compute_subnetwork.main: Read complete after 0s [id=projects/sha-dmartinez-network/regions/us-central1/subnetworks/dev-us-central1]
google_service_account.frontend[0]: Refreshing state... [id=projects/dev-iac-demo/serviceAccounts/demo-app-frontend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_service_account.backend[0]: Refreshing state... [id=projects/dev-iac-demo/serviceAccounts/demo-app-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fsha-dmartinez-network%2Fglobal%2Fnetworks%2Fmy-dev-vpc:servicenetworking.googleapis.com]
google_cloud_run_v2_service.frontend[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/services/demo-app-frontend]
google_project_iam_member.backend_cloudsql[0]: Refreshing state... [id=dev-iac-demo/roles/cloudsql.client/serviceAccount:demo-app-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_cloud_run_v2_service.backend[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/services/demo-app-backend]
google_project_iam_member.backend_memorystore[0]: Refreshing state... [id=dev-iac-demo/roles/redis.editor/serviceAccount:demo-app-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_firestore[0]: Refreshing state... [id=dev-iac-demo/roles/datastore.user/serviceAccount:demo-app-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_pubsub[0]: Refreshing state... [id=dev-iac-demo/roles/pubsub.editor/serviceAccount:demo-app-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_cloudsql_iam_user[0]: Refreshing state... [id=dev-iac-demo/roles/cloudsql.instanceUser/serviceAccount:demo-app-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_redis_instance.cache[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/instances/demo-app-redis]
google_sql_database_instance.postgres[0]: Refreshing state... [id=demo-app-pg]
google_compute_region_network_endpoint_group.frontend_neg[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/networkEndpointGroups/demo-app-frontend-neg]
google_compute_region_network_endpoint_group.backend_neg[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/networkEndpointGroups/demo-app-backend-neg]
google_cloud_run_v2_service_iam_member.frontend_invoker[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/services/demo-app-backend/roles/run.invoker/serviceAccount:demo-app-frontend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_sql_user.iam_user[0]: Refreshing state... [id=demo-app-backend-sa@dev-iac-demo.iam//demo-app-pg]
google_compute_backend_service.frontend_backend[0]: Refreshing state... [id=projects/dev-iac-demo/global/backendServices/demo-app-frontend-backend]
google_compute_region_backend_service.backend_backend[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/backendServices/demo-app-backend-internal]
google_compute_url_map.external[0]: Refreshing state... [id=projects/dev-iac-demo/global/urlMaps/demo-app-external-url-map]
google_compute_region_url_map.internal[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/urlMaps/demo-app-internal-url-map]
google_compute_target_https_proxy.external[0]: Refreshing state... [id=projects/dev-iac-demo/global/targetHttpsProxies/demo-app-https-proxy]
google_compute_global_forwarding_rule.external[0]: Refreshing state... [id=projects/dev-iac-demo/global/forwardingRules/demo-app-forwarding-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service.backend[0] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
      ~ effective_labels        = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        id                      = "projects/dev-iac-demo/locations/us-central1/services/demo-app-backend"
      ~ labels                  = {
          ~ "team"        = "my-team" -> "my-other-team"
            # (2 unchanged elements hidden)
        }
        name                    = "demo-app-backend"
      ~ terraform_labels        = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_v2_service.frontend[0] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "frontend" {
      ~ effective_labels        = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        id                      = "projects/dev-iac-demo/locations/us-central1/services/demo-app-frontend"
      ~ labels                  = {
          ~ "team"        = "my-team" -> "my-other-team"
            # (2 unchanged elements hidden)
        }
        name                    = "demo-app-frontend"
      ~ terraform_labels        = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # google_compute_backend_service.frontend_backend[0] will be updated in-place
  ~ resource "google_compute_backend_service" "frontend_backend" {
        id                                            = "projects/dev-iac-demo/global/backendServices/demo-app-frontend-backend"
        name                                          = "demo-app-frontend-backend"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # google_compute_global_address.external_ip[0] will be updated in-place
  ~ resource "google_compute_global_address" "external_ip" {
      ~ effective_labels   = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        id                 = "projects/dev-iac-demo/global/addresses/demo-app-external-lb-ip"
      ~ labels             = {
          ~ "team"        = "my-team" -> "my-other-team"
            # (2 unchanged elements hidden)
        }
        name               = "demo-app-external-lb-ip"
      ~ terraform_labels   = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # google_project_service.apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dev-iac-demo"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.apis["logging.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dev-iac-demo"
      + service            = "logging.googleapis.com"
    }

  # google_pubsub_topic.main_topic[0] will be updated in-place
  ~ resource "google_pubsub_topic" "main_topic" {
      ~ effective_labels = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        id               = "projects/dev-iac-demo/topics/demo-app-topic"
      ~ labels           = {
          ~ "team"        = "my-team" -> "my-other-team"
            # (2 unchanged elements hidden)
        }
        name             = "demo-app-topic"
      ~ terraform_labels = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # google_redis_instance.cache[0] will be updated in-place
  ~ resource "google_redis_instance" "cache" {
      ~ effective_labels            = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        id                          = "projects/dev-iac-demo/locations/us-central1/instances/demo-app-redis"
      ~ labels                      = {
          ~ "team"        = "my-team" -> "my-other-team"
            # (2 unchanged elements hidden)
        }
        name                        = "demo-app-redis"
      ~ terraform_labels            = {
          ~ "team"                       = "my-team" -> "my-other-team"
            # (3 unchanged elements hidden)
        }
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_sql_database_instance.postgres[0] will be updated in-place
  ~ resource "google_sql_database_instance" "postgres" {
      ~ deletion_protection            = false -> true
        id                             = "demo-app-pg"
        name                           = "demo-app-pg"
        # (16 unchanged attributes hidden)

      ~ settings {
          ~ user_labels                  = {
              ~ "team"        = "my-team" -> "my-other-team"
                # (2 unchanged elements hidden)
            }
            # (16 unchanged attributes hidden)

          ~ ip_configuration {
              ~ ssl_mode                                      = "ALLOW_UNENCRYPTED_AND_ENCRYPTED" -> "ENCRYPTED_ONLY"
                # (5 unchanged attributes hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_sql_user.iam_user[0] will be updated in-place
  ~ resource "google_sql_user" "iam_user" {
        id                      = "demo-app-backend-sa@dev-iac-demo.iam//demo-app-pg"
        name                    = "demo-app-backend-sa@dev-iac-demo.iam"
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 8 to change, 0 to destroy.

Warning: Deprecated Resource

  with google_iap_brand.default,
  on load-balancer.tf line 42, in resource "google_iap_brand" "default":
  42: resource "google_iap_brand" "default" {

This resource is deprecated on Jan 22, 2025. After Jan 19, 2026 the
`google_iap_brand` Terraform resource will no longer function as intended due
to the deprecation of the IAP OAuth Admin APIs. New projects will not be able
to use these APIs. March 19, 2026 The IAP OAuth Admin APIs will be
permanently shut down. Access to this feature will no longer be available.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```


**Plan for live/dev/demo-app-copy**
```

time=2025-11-08T04:49:37Z level=info msg=Downloading Terraform configurations from file:///workspace into /workspace/live/dev/demo-app-copy/.terragrunt-cache/BCTS51x9EYLKGZDA5fZb_9tZZN0/iR00K09ud9CpNN9X6qOBki7MM4Y

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "~> 7.9.0"...
- Finding latest version of hashicorp/google-beta...
- Installing hashicorp/google v7.9.0...
- Installed hashicorp/google v7.9.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v7.10.0...
- Installed hashicorp/google-beta v7.10.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_service_account_access_token.default: Reading...
data.google_client_config.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/dev-iac-demo/regions/us-central1/zones/us-central1-a]
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/dev-iac-deployer@dev-iac-demo.iam.gserviceaccount.com]
google_project_service_identity.iap_sa: Refreshing state... [id=projects/dev-iac-demo/services/iap.googleapis.com]
google_service_account.backend[0]: Refreshing state... [id=projects/dev-iac-demo/serviceAccounts/demo-app-copy-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_service.apis["servicenetworking.googleapis.com"]: Refreshing state... [id=dev-iac-demo/servicenetworking.googleapis.com]
google_compute_global_address.external_ip[0]: Refreshing state... [id=projects/dev-iac-demo/global/addresses/demo-app-copy-external-lb-ip]
google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=dev-iac-demo/vpcaccess.googleapis.com]
data.google_compute_subnetwork.main: Reading...
google_pubsub_topic.main_topic[0]: Refreshing state... [id=projects/dev-iac-demo/topics/demo-app-copy-topic]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=dev-iac-demo/compute.googleapis.com]
google_project_service.apis["firestore.googleapis.com"]: Refreshing state... [id=dev-iac-demo/firestore.googleapis.com]
google_project_service.apis["redis.googleapis.com"]: Refreshing state... [id=dev-iac-demo/redis.googleapis.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=dev-iac-demo/run.googleapis.com]
google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=dev-iac-demo/sqladmin.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=dev-iac-demo/iam.googleapis.com]
data.google_compute_subnetwork.main: Read complete after 0s [id=projects/sha-dmartinez-network/regions/us-central1/subnetworks/dev-us-central1]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=dev-iac-demo/pubsub.googleapis.com]
google_service_account.frontend[0]: Refreshing state... [id=projects/dev-iac-demo/serviceAccounts/demo-app-copy-frontend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_firestore_database.database[0]: Refreshing state... [id=projects/dev-iac-demo/databases/demo-app-copy-firestore]
google_compute_managed_ssl_certificate.default[0]: Refreshing state... [id=projects/dev-iac-demo/global/sslCertificates/demo-app-copy-ssl-cert]
data.google_compute_network.main: Reading...
data.google_compute_network.main: Read complete after 0s [id=projects/sha-dmartinez-network/global/networks/my-dev-vpc]
google_project_iam_member.backend_cloudsql_iam_user[0]: Refreshing state... [id=dev-iac-demo/roles/cloudsql.instanceUser/serviceAccount:demo-app-copy-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_cloudsql[0]: Refreshing state... [id=dev-iac-demo/roles/cloudsql.client/serviceAccount:demo-app-copy-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_memorystore[0]: Refreshing state... [id=dev-iac-demo/roles/redis.editor/serviceAccount:demo-app-copy-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_firestore[0]: Refreshing state... [id=dev-iac-demo/roles/datastore.user/serviceAccount:demo-app-copy-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_project_iam_member.backend_pubsub[0]: Refreshing state... [id=dev-iac-demo/roles/pubsub.editor/serviceAccount:demo-app-copy-backend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fsha-dmartinez-network%2Fglobal%2Fnetworks%2Fmy-dev-vpc:servicenetworking.googleapis.com]
google_cloud_run_v2_service.backend[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/services/demo-app-copy-backend]
google_cloud_run_v2_service.frontend[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/services/demo-app-copy-frontend]
google_redis_instance.cache[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/instances/demo-app-copy-redis]
google_sql_database_instance.postgres[0]: Refreshing state... [id=demo-app-copy-pg]
google_cloud_run_v2_service_iam_member.frontend_invoker[0]: Refreshing state... [id=projects/dev-iac-demo/locations/us-central1/services/demo-app-copy-backend/roles/run.invoker/serviceAccount:demo-app-copy-frontend-sa@dev-iac-demo.iam.gserviceaccount.com]
google_compute_region_network_endpoint_group.backend_neg[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/networkEndpointGroups/demo-app-copy-backend-neg]
google_compute_region_network_endpoint_group.frontend_neg[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/networkEndpointGroups/demo-app-copy-frontend-neg]
google_sql_user.iam_user[0]: Refreshing state... [id=demo-app-copy-backend-sa@dev-iac-demo.iam//demo-app-copy-pg]
google_compute_region_backend_service.backend_backend[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/backendServices/demo-app-copy-backend-internal]
google_compute_backend_service.frontend_backend[0]: Refreshing state... [id=projects/dev-iac-demo/global/backendServices/demo-app-copy-frontend-backend]
google_compute_region_url_map.internal[0]: Refreshing state... [id=projects/dev-iac-demo/regions/us-central1/urlMaps/demo-app-copy-internal-url-map]
google_compute_url_map.external[0]: Refreshing state... [id=projects/dev-iac-demo/global/urlMaps/demo-app-copy-external-url-map]
google_compute_target_https_proxy.external[0]: Refreshing state... [id=projects/dev-iac-demo/global/targetHttpsProxies/demo-app-copy-https-proxy]
google_compute_global_forwarding_rule.external[0]: Refreshing state... [id=projects/dev-iac-demo/global/forwardingRules/demo-app-copy-forwarding-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_project_service.apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dev-iac-demo"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.apis["logging.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dev-iac-demo"
      + service            = "logging.googleapis.com"
    }

  # google_redis_instance.cache[0] will be updated in-place
  ~ resource "google_redis_instance" "cache" {
        id                          = "projects/dev-iac-demo/locations/us-central1/instances/demo-app-copy-redis"
        name                        = "demo-app-copy-redis"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_sql_database_instance.postgres[0] will be updated in-place
  ~ resource "google_sql_database_instance" "postgres" {
        id                             = "demo-app-copy-pg"
        name                           = "demo-app-copy-pg"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # google_sql_user.iam_user[0] will be updated in-place
  ~ resource "google_sql_user" "iam_user" {
        id                      = "demo-app-copy-backend-sa@dev-iac-demo.iam//demo-app-copy-pg"
        name                    = "demo-app-copy-backend-sa@dev-iac-demo.iam"
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Deprecated Resource

  with google_iap_brand.default,
  on load-balancer.tf line 42, in resource "google_iap_brand" "default":
  42: resource "google_iap_brand" "default" {

This resource is deprecated on Jan 22, 2025. After Jan 19, 2026 the
`google_iap_brand` Terraform resource will no longer function as intended due
to the deprecation of the IAP OAuth Admin APIs. New projects will not be able
to use these APIs. March 19, 2026 The IAP OAuth Admin APIs will be
permanently shut down. Access to this feature will no longer be available.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```


**Plan for live/prod/other-demo-app**
```

time=2025-11-08T04:49:50Z level=info msg=Downloading Terraform configurations from file:///workspace into /workspace/live/prod/other-demo-app/.terragrunt-cache/wdmY1kkZo_W_LIBxzJoG1PSSLR8/iR00K09ud9CpNN9X6qOBki7MM4Y

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "~> 7.9.0"...
- Finding latest version of hashicorp/google-beta...
- Installing hashicorp/google v7.9.0...
- Installed hashicorp/google v7.9.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v7.10.0...
- Installed hashicorp/google-beta v7.10.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_client_config.default: Reading...
data.google_service_account_access_token.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/dev-iac-demo/regions/us-central1/zones/us-central1-a]
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/prod-iac-deployer@prod-iac-demo.iam.gserviceaccount.com]
data.google_compute_network.main: Reading...
data.google_compute_subnetwork.main: Reading...
data.google_compute_subnetwork.main: Read complete after 0s [id=projects/sha-dmartinez-network/regions/us-central1/subnetworks/prod-us-central1]
data.google_compute_network.main: Read complete after 0s [id=projects/sha-dmartinez-network/global/networks/my-prod-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.backend[0] will be created
  + resource "google_cloud_run_v2_service" "backend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + default_uri_disabled    = true
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_ONLY"
      + labels                  = {
          + "application" = "other-demo-app"
          + "environment" = "prod"
          + "team"        = "my-team"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "other-demo-app-backend"
      + observed_generation     = (known after apply)
      + project                 = "prod-iac-demo"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + resources {
                  + limits = {
                      + "cpu"    = "2"
                      + "memory" = "512Mi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }

          + vpc_access {
              + egress = "ALL_TRAFFIC"

              + network_interfaces {
                  + network    = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
                  + subnetwork = "projects/sha-dmartinez-network/regions/us-central1/subnetworks/prod-us-central1"
                }
            }
        }
    }

  # google_cloud_run_v2_service.frontend[0] will be created
  + resource "google_cloud_run_v2_service" "frontend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + default_uri_disabled    = true
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + labels                  = {
          + "application" = "other-demo-app"
          + "environment" = "prod"
          + "team"        = "my-team"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "other-demo-app-frontend"
      + observed_generation     = (known after apply)
      + project                 = "prod-iac-demo"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "other-demo-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + resources {
                  + limits = {
                      + "cpu"    = "2"
                      + "memory" = "512Mi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }

          + vpc_access {
              + egress = "ALL_TRAFFIC"

              + network_interfaces {
                  + network    = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
                  + subnetwork = "projects/sha-dmartinez-network/regions/us-central1/subnetworks/prod-us-central1"
                }
            }
        }
    }

  # google_cloud_run_v2_service_iam_member.frontend_invoker[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "frontend_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "serviceAccount:other-demo-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + name     = "other-demo-app-backend"
      + project  = "prod-iac-demo"
      + role     = "roles/run.invoker"
    }

  # google_compute_backend_service.frontend_backend[0] will be created
  + resource "google_compute_backend_service" "frontend_backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "other-demo-app-frontend-backend"
      + port_name                       = (known after apply)
      + project                         = "prod-iac-demo"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }
    }

  # google_compute_global_address.external_ip[0] will be created
  + resource "google_compute_global_address" "external_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + labels             = {
          + "application" = "other-demo-app"
          + "environment" = "prod"
          + "team"        = "my-team"
        }
      + name               = "other-demo-app-external-lb-ip"
      + prefix_length      = (known after apply)
      + project            = "prod-iac-demo"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
    }

  # google_compute_global_forwarding_rule.external[0] will be created
  + resource "google_compute_global_forwarding_rule" "external" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "TCP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL_MANAGED"
      + name                  = "other-demo-app-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "prod-iac-demo"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)
    }

  # google_compute_managed_ssl_certificate.default[0] will be created
  + resource "google_compute_managed_ssl_certificate" "default" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "other-demo-app-ssl-cert"
      + project                   = "prod-iac-demo"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "other-demo-app.demo.altostrat.com",
            ]
        }
    }

  # google_compute_region_backend_service.backend_backend[0] will be created
  + resource "google_compute_region_backend_service" "backend_backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "INTERNAL_MANAGED"
      + name                            = "other-demo-app-backend-internal"
      + port_name                       = (known after apply)
      + project                         = "prod-iac-demo"
      + protocol                        = "HTTPS"
      + region                          = "us-central1"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode = "UTILIZATION"
          + failover       = (known after apply)
          + group          = (known after apply)
        }
    }

  # google_compute_region_network_endpoint_group.backend_neg[0] will be created
  + resource "google_compute_region_network_endpoint_group" "backend_neg" {
      + id                    = (known after apply)
      + name                  = "other-demo-app-backend-neg"
      + network               = (known after apply)
      + network_endpoint_type = "SERVERLESS"
      + project               = "prod-iac-demo"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "other-demo-app-backend"
        }
    }

  # google_compute_region_network_endpoint_group.frontend_neg[0] will be created
  + resource "google_compute_region_network_endpoint_group" "frontend_neg" {
      + id                    = (known after apply)
      + name                  = "other-demo-app-frontend-neg"
      + network               = (known after apply)
      + network_endpoint_type = "SERVERLESS"
      + project               = "prod-iac-demo"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "other-demo-app-frontend"
        }
    }

  # google_compute_region_url_map.internal[0] will be created
  + resource "google_compute_region_url_map" "internal" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "other-demo-app-internal-url-map"
      + project            = "prod-iac-demo"
      + region             = "us-central1"
      + self_link          = (known after apply)
    }

  # google_compute_target_https_proxy.external[0] will be created
  + resource "google_compute_target_https_proxy" "external" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "other-demo-app-https-proxy"
      + project            = "prod-iac-demo"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.external[0] will be created
  + resource "google_compute_url_map" "external" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "other-demo-app-external-url-map"
      + project            = "prod-iac-demo"
      + self_link          = (known after apply)
    }

  # google_firestore_database.database[0] will be created
  + resource "google_firestore_database" "database" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + database_edition                  = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "other-demo-app-firestore"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "prod-iac-demo"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_project_iam_member.backend_cloudsql[0] will be created
  + resource "google_project_iam_member" "backend_cloudsql" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + project = "prod-iac-demo"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.backend_cloudsql_iam_user[0] will be created
  + resource "google_project_iam_member" "backend_cloudsql_iam_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + project = "prod-iac-demo"
      + role    = "roles/cloudsql.instanceUser"
    }

  # google_project_iam_member.backend_firestore[0] will be created
  + resource "google_project_iam_member" "backend_firestore" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + project = "prod-iac-demo"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.backend_memorystore[0] will be created
  + resource "google_project_iam_member" "backend_memorystore" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + project = "prod-iac-demo"
      + role    = "roles/redis.editor"
    }

  # google_project_iam_member.backend_pubsub[0] will be created
  + resource "google_project_iam_member" "backend_pubsub" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + project = "prod-iac-demo"
      + role    = "roles/pubsub.editor"
    }

  # google_project_service.apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.apis["firestore.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "firestore.googleapis.com"
    }

  # google_project_service.apis["iam.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.apis["logging.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.apis["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "pubsub.googleapis.com"
    }

  # google_project_service.apis["redis.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "redis.googleapis.com"
    }

  # google_project_service.apis["run.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "run.googleapis.com"
    }

  # google_project_service.apis["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "servicenetworking.googleapis.com"
    }

  # google_project_service.apis["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.apis["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prod-iac-demo"
      + service            = "vpcaccess.googleapis.com"
    }

  # google_project_service_identity.iap_sa will be created
  + resource "google_project_service_identity" "iap_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prod-iac-demo"
      + service = "iap.googleapis.com"
    }

  # google_pubsub_topic.main_topic[0] will be created
  + resource "google_pubsub_topic" "main_topic" {
      + effective_labels = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + id               = (known after apply)
      + labels           = {
          + "application" = "other-demo-app"
          + "environment" = "prod"
          + "team"        = "my-team"
        }
      + name             = "other-demo-app-topic"
      + project          = "prod-iac-demo"
      + terraform_labels = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
    }

  # google_redis_instance.cache[0] will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id     = (known after apply)
      + auth_enabled                = false
      + auth_string                 = (sensitive value)
      + authorized_network          = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
      + connect_mode                = "PRIVATE_SERVICE_ACCESS"
      + create_time                 = (known after apply)
      + current_location_id         = (known after apply)
      + effective_labels            = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + effective_reserved_ip_range = (known after apply)
      + host                        = (known after apply)
      + id                          = (known after apply)
      + labels                      = {
          + "application" = "other-demo-app"
          + "environment" = "prod"
          + "team"        = "my-team"
        }
      + location_id                 = "us-central1-a"
      + maintenance_schedule        = (known after apply)
      + maintenance_version         = (known after apply)
      + memory_size_gb              = 1
      + name                        = "other-demo-app-redis"
      + nodes                       = (known after apply)
      + persistence_iam_identity    = (known after apply)
      + port                        = (known after apply)
      + project                     = "prod-iac-demo"
      + read_endpoint               = (known after apply)
      + read_endpoint_port          = (known after apply)
      + read_replicas_mode          = (known after apply)
      + redis_version               = (known after apply)
      + region                      = (known after apply)
      + replica_count               = (known after apply)
      + reserved_ip_range           = (known after apply)
      + secondary_ip_range          = (known after apply)
      + server_ca_certs             = (known after apply)
      + terraform_labels            = {
          + "application"                = "other-demo-app"
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "my-team"
        }
      + tier                        = "BASIC"
      + transit_encryption_mode     = "DISABLED"
    }

  # google_service_account.backend[0] will be created
  + resource "google_service_account" "backend" {
      + account_id   = "other-demo-app-backend-sa"
      + disabled     = false
      + display_name = "Service Account for other-demo-app backend"
      + email        = "other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:other-demo-app-backend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "prod-iac-demo"
      + unique_id    = (known after apply)
    }

  # google_service_account.frontend[0] will be created
  + resource "google_service_account" "frontend" {
      + account_id   = "other-demo-app-frontend-sa"
      + disabled     = false
      + display_name = "Service Account for other-demo-app frontend"
      + email        = "other-demo-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:other-demo-app-frontend-sa@prod-iac-demo.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "prod-iac-demo"
      + unique_id    = (known after apply)
    }

  # google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "dev-private-services-access",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # google_sql_database_instance.postgres[0] will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_14"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "other-demo-app-pg"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "prod-iac-demo"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-central1"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-g1-small"
          + user_labels                 = {
              + "application" = "other-demo-app"
              + "environment" = "prod"
              + "team"        = "my-team"
            }
          + version                     = (known after apply)

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/sha-dmartinez-network/global/networks/my-prod-vpc"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = "ENCRYPTED_ONLY"
            }
        }
    }

  # google_sql_user.iam_user[0] will be created
  + resource "google_sql_user" "iam_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "other-demo-app-pg"
      + name                    = "other-demo-app-backend-sa@prod-iac-demo.iam"
      + project                 = "prod-iac-demo"
      + sql_server_user_details = (known after apply)
      + type                    = "CLOUD_IAM_SERVICE_ACCOUNT"
    }

Plan: 38 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with google_iap_brand.default,
  on load-balancer.tf line 42, in resource "google_iap_brand" "default":
  42: resource "google_iap_brand" "default" {

This resource is deprecated on Jan 22, 2025. After Jan 19, 2026 the
`google_iap_brand` Terraform resource will no longer function as intended due
to the deprecation of the IAP OAuth Admin APIs. New projects will not be able
to use these APIs. March 19, 2026 The IAP OAuth Admin APIs will be
permanently shut down. Access to this feature will no longer be available.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>